OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/lagrangian/reactingParcelFoam/splashPanelFilm/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    sides
    {
        type            totalPressure;
        p0              $internalField;
    }

    "(film|wallFilm).*"
    {
        type            fixedFluxPressure;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
